src/БиблиотекаИнструментовРазработки/src/ChartsOfCharacteristicTypes/бир_НастраиваемыеЗначения/бир_НастраиваемыеЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>бир_НастраиваемыеЗначения</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ГруппаНастроек1</name>
      <description>Группа настроек 1</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>AnyRef</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/БиблиотекаИнструментовРазработки/src/ChartsOfCharacteristicTypes/бир_НастраиваемыеЗначения/ManagerModule.bsl
Функция Получить(ИмяЗначения) Экспорт
	
	Результат = Неопределено;
	
	Попытка
		ЭлементЗначения = ПланыВидовХарактеристик.бир_НастраиваемыеЗначения[ИмяЗначения];
	Исключение
		ТекстОшибки = "Ошибка получения значения: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ЭлементЗначения.Список.Количество() > 0 Тогда
		Результат = ЭлементЗначения.Список.ВыгрузитьКолонку("Значение");
	Иначе
		Результат = ЭлементЗначения.Значение;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции //Получить()
